[
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1d5ovo5/rcasualconversation_welcome_thread_month_of_june/",
        "thread_title": "r/CasualConversation Welcome Thread - Month of June 01, 2024",
        "thread_id": "1d5ovo5",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "Hi, Im new to Reddit. I’m kinda old, so I hope this is a place for me too!\n\nI’m a drummer of two years taking lessons in New Orleans.  Also taking guitar lessons.  \n\nI’m retired from the VA Medical Center in Biloxi Mississippi.  Retirement is awesome.  All you working people - you’re gonna love this. \n\nThats when i started playing music. It’s been a lifelong dream.  Keeps me on my toes. My drum teacher don’t mess around !! LOL",
                "comment_url": "/r/CasualConversation/comments/1d5ovo5/rcasualconversation_welcome_thread_month_of_june/l9koknr/",
                "comment_id": "l9koknr"
            },
            {
                "comment_body": "Hi all. I am happy to be at 'this corner of Reddit!'  I am a relatively (a few months) new r/   member and have found a great deal of bullying and anger.  Hoping to see none of that here.  Not such a hot thing, that I am looking for something that is not there.... in my little world I try my best to focus on things I want instead of things I do not want.  I am a senior citizen and  still not accustomed to the online world.",
                "comment_url": "/r/CasualConversation/comments/1d5ovo5/rcasualconversation_welcome_thread_month_of_june/l9awbg2/",
                "comment_id": "l9awbg2"
            },
            {
                "comment_body": "Nothing like responding to a post and having a bot tell you you should not be posting due to low karma. \n\nIt would be nice if you could not join if you are not goomg to be allowed to participate. \n\nIncreasing karma past 3 has been difficult. I've been on this account over a year and it's just ... there. \n\nI read that participation on this page would help ... I've been here a short period and seem nothing that makes this seem true. \n\nSo this long winded start is to simply see if it's true ... others with the same issue are welcome to make comments in response. Feel free to like others comments. \n\nSingapore sing dance a dance or simply say hello.",
                "comment_url": "/r/CasualConversation/comments/1d5ovo5/rcasualconversation_welcome_thread_month_of_june/l9k12mw/",
                "comment_id": "l9k12mw"
            },
            {
                "comment_body": "Just wondering if media newscasters might kick start actual thinking about people's vote.  Instead of just asking folks who they would vote for; follow up with asking what the chosen candidate has actually accomplished to directly impact the voter and/or society in a positive way.  I know the news wants to stir up controversy, but might this small step move away from emotional voting and get people to avoid choosing a candidate who looks good on camera and promises the moon.",
                "comment_url": "/r/CasualConversation/comments/1d5ovo5/rcasualconversation_welcome_thread_month_of_june/l78hm5o/",
                "comment_id": "l78hm5o"
            },
            {
                "comment_body": "Hi!! New here on Reddit!! I wasn't sure to join this place because heard about not so nice things about some places inside it, but, decided to give it a try and see how it really is. Seems like there are genuinely good and welcoming places here! \n\n\nI joined here because I saw there are communuties about things that interests me and I an into them like drawing, art, videogames, animation and animals. I have been learning to make art for over a year and also sharing my progress online, so it's nice to have another place to do that and find people that also love art and support each other. Also, starting to be more open to interact with people and talk to them as I am pretty shy and quiet.  \n\n\nHope to have a good time here and it's really nice to meet you!! ",
                "comment_url": "/r/CasualConversation/comments/1d5ovo5/rcasualconversation_welcome_thread_month_of_june/larv000/",
                "comment_id": "larv000"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr0j0z/i_love_my_little_brother_so_damn_much/",
        "thread_title": "I love my little brother so damn much",
        "thread_id": "1dr0j0z",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "I absolutely love this! 💜 sibling love is like no other. I have 3 younger sisters and there's 5 years between each one of us (I'm 27, one is 22, one is 17, one is 12) and all 4 of us are super close. Myself and my 22 year old sister have moved out with our partners now but when all 4 of us get together, we never want the day/night to end. I LOVE being the big sister and I feel well looked after by my little sisters too. Its so lovely to see someone expressing their unconditional love for their siblings, because I feel the same way about mine.",
                "comment_url": "/r/CasualConversation/comments/1dr0j0z/i_love_my_little_brother_so_damn_much/lat35yb/",
                "comment_id": "lat35yb"
            },
            {
                "comment_body": "Thanks for the serotonin boost, reddit anon! Sincerely, an only child. \n\nBe sure to keep in touch even when you're in college later! Just 15-30 minutes of Facetime should be enough, and speaking as someone in his 5th semester of college starting September? You'll definitely need those talks/calls when things start getting hard academically.\n\nGive him the biggest bear hugs everyday while you still can and he still lets you. Some kids are just born with personality sliders on \"Good\" maxed out, and that's amazing.",
                "comment_url": "/r/CasualConversation/comments/1dr0j0z/i_love_my_little_brother_so_damn_much/lat6b49/",
                "comment_id": "lat6b49"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr25nh/anyone_miss_24hr_stores/",
        "thread_title": "Anyone miss 24hr stores?",
        "thread_id": "1dr25nh",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "I work nights, 5pm-midnight.  I miss the fuck out of some 1am walmart shopping.  I get dropping that in rural areas, but I live near a large campus.  Even at 3am the store would be busy.  Plus I am not one to go to bed early, so late at night, I do things, like an oil change, or notice a light bulb out, or rip a button off a shirt and need a sewing kit.  Walmart was always my option.  No more.",
                "comment_url": "/r/CasualConversation/comments/1dr25nh/anyone_miss_24hr_stores/lasq6cj/",
                "comment_id": "lasq6cj"
            },
            {
                "comment_body": "My favorite part of my pre-retirement days was popping a few vics and going to Walmart at 2am to shop until 4am.  Sure there were a lot of people stocking the aisles and I had to navigate scattered boxes, but at least I was able to browse and enjoy myself as it was quiet with no kids dancing around like wild monkeys and screaming.\n\nThere are a few grocery stores near me that are still 24 hour stores - WinCo for one - although b/c they are on the other side of town I found going early after dropping my kid off to work to be just as pleasant, you only have a few older folks shuffling around.",
                "comment_url": "/r/CasualConversation/comments/1dr25nh/anyone_miss_24hr_stores/lasv1f0/",
                "comment_id": "lasv1f0"
            },
            {
                "comment_body": "I work second shift and usually get off at 8, sometimes as late as midnight.  Before Covid this wasn't a problem.  Grocery stores and Walmart were open, no matter how late I got off.  I could pick up almost anything I needed on the way home from work.  But now?  Not so much.  \n\nThen there is the fact that grocery shopping when most people have gone to bed is a very peaceful feeling.  I can take half an hour looking at vegetables and comparing recipes on my phone without ever being in anyone's way except possibly an employee who is stocking.",
                "comment_url": "/r/CasualConversation/comments/1dr25nh/anyone_miss_24hr_stores/lasvj2m/",
                "comment_id": "lasvj2m"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dqvq81/im_like_99_sure_i_just_saw_someone_find_me/",
        "thread_title": "I'm like 99% sure I just saw someone find me attractive for the first time",
        "thread_id": "1dqvq81",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "Keep going and do savor these experiences. \n\nI used to have them when I was younger but now I\n Old and fat and just don’t get these types of looks or comments anymore. Doesn’t affect me (I am happily married) but reading this reminded me of some of those moments long ago. \n\nFlip side is now I go about my day not worrying too much about what I’m wearing. How my hair looks.  I’m at the phase of T-shirt and flip flops. Don’t care what car I drive all my clothes from Costco etc.",
                "comment_url": "/r/CasualConversation/comments/1dqvq81/im_like_99_sure_i_just_saw_someone_find_me/larq5dr/",
                "comment_id": "larq5dr"
            },
            {
                "comment_body": "That's great news my dude! I only now realised how important it is how we look. I usually dress in a, let's say pretty extreme style (warcore), so people don't really approach me, but a few days ago I had to dress very formally, with a tie on and everything. 3 people approached me to ask for help that they. People never ask me for help. When I took the bus home I asked a cute girl if I could sit next to her, she looked up, gave me the most delightful smile I've ever seen and said \"sure\". I swear it was one of the best days of my life because of those small interactions. So yeah. Great job dude, on everything! Keep up, be positive about everything my man 🤝",
                "comment_url": "/r/CasualConversation/comments/1dqvq81/im_like_99_sure_i_just_saw_someone_find_me/larnuoa/",
                "comment_id": "larnuoa"
            },
            {
                "comment_body": "I had a moment like this once . I was taking a walk and I want to say I had a good summer attire it was hot that day, and a woman stopped her car brought her sunglasses slightly down brought down her window, just enough to have a better visual a suppose and just gave me a hard check. I was walking with my girl then and still the woman did not care. I was happy and felt extra special the rest of the day.",
                "comment_url": "/r/CasualConversation/comments/1dqvq81/im_like_99_sure_i_just_saw_someone_find_me/latvcja/",
                "comment_id": "latvcja"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr77xg/if_you_could_manipulate_people_for_one_day_whats/",
        "thread_title": "If you could manipulate people for one day what's the first thing you do?",
        "thread_id": "1dr77xg",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "Make sure all politicians actually do their jobs.\n\nWe don't realize, or maybe we do, but if all the politicians actually did their jobs, instead of being puppets of the greedy corporations and complexes just because they throw money at them, then most of the bad things happening around the world, wouldn't.\n\nThe a-holes would be arrested, put in the darkest corners of the world. And we would have utopia.\n\nThe next step is erasing the same thoughts in others, so the human nature doesn't take over and destroy that utopia.\n\nOR.\n\nI'd just manipulate everyone into killing themselves. No more humans. I'd inherit the earth.\n\n&#x200B;\n\nIt depends on what my state of mind is when I get these powers.",
                "comment_url": "/r/CasualConversation/comments/1dr77xg/if_you_could_manipulate_people_for_one_day_whats/latnjdc/",
                "comment_id": "latnjdc"
            },
            {
                "comment_body": "I am sure I’d find a way to balance out my positive actions later on with something more problematic because famously no one has ever been capable of keeping a level head when they have too much power. But honestly, I wish I could influence people to train their brains out of negative self thought and offer them a day of feeling relaxed and happy in their heads because their inner dialogue is only encouraging them and making them feel good about themselves and capable of the things they want to do and feel good about it",
                "comment_url": "/r/CasualConversation/comments/1dr77xg/if_you_could_manipulate_people_for_one_day_whats/latnrd8/",
                "comment_id": "latnrd8"
            },
            {
                "comment_body": "I'd force all of the public to turn their rage, their disdain, their disrespect and everything to the people who are truly the problem of the world much less the country.\n\nEvery executive, politician, billionaire, millionaire and power-player would really know the wrath of a collective public who's absolutely tired of their shit. It won't any longer be just a thing we see in movies where this scenario is all just fiction because nobody is ever united enough.",
                "comment_url": "/r/CasualConversation/comments/1dr77xg/if_you_could_manipulate_people_for_one_day_whats/latmrpd/",
                "comment_id": "latmrpd"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dquxrt/whats_something_youre_surprisingly_bad_at/",
        "thread_title": "What's something you're surprisingly bad at?",
        "thread_id": "1dquxrt",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "Directions. If you tell me something is north of another place, I have no idea what you're talking about. Even after growing up in a small town and living there for over 20 years, I never remembered the street names. I remember things based off of landmarks. I live in the city now, and I rely on my GPS to get me places. I'll remember some random locations, but I'll probably never really become fluent with the street names and describing to others where I live, or how to get to other places.",
                "comment_url": "/r/CasualConversation/comments/1dquxrt/whats_something_youre_surprisingly_bad_at/laqx4sj/",
                "comment_id": "laqx4sj"
            },
            {
                "comment_body": "im genuinely awful at counting. art? great at that. writing? pretty decent. but basic math?? idk what it is but i lose all of my cognitive abilities looking at numbers. even phone numbers i struggle to remember and pins i have to copy down digit by digit. i can barely subtract, addition is hard, multiplication and division impossible.\n\ncounting is the most embarassing though. because i will start counting somethine and by like number 5 i start to get confused, will double count or skip numbers by accident.",
                "comment_url": "/r/CasualConversation/comments/1dquxrt/whats_something_youre_surprisingly_bad_at/las8fma/",
                "comment_id": "las8fma"
            },
            {
                "comment_body": "Everything. 🫠💀 No but I can’t dance to save my life, I also can’t shuffle a deck of cards, I can’t whistle, & I have terrible handwriting lol. Just the things I can think of off the top of my head.\n\nEdit: also building stuff from scratch or piecing stuff together. I get overwhelmed and overstimulated easily by the manuals and the pieces. Also please don’t ask me to troubleshoot any type of technology issue. My brain immediately goes 404: Error code.",
                "comment_url": "/r/CasualConversation/comments/1dquxrt/whats_something_youre_surprisingly_bad_at/lasdrnm/",
                "comment_id": "lasdrnm"
            },
            {
                "comment_body": "Probably following people's orders and doing what's (obviously) best for them. I'm just so bad at understanding what to do if anything goes wrong and the person who gave me those orders isn't around to instruct me. If someone wants to instruct me so everything will get done they have to be very specific and even tell me what to do if anything goes wrong, or else I'll probably mess it up. The reason this is so especially surprising is bc I'm not a leader type at all. I'm a follower, so you'd think id be good at understanding what people need me to do.",
                "comment_url": "/r/CasualConversation/comments/1dquxrt/whats_something_youre_surprisingly_bad_at/latjanr/",
                "comment_id": "latjanr"
            },
            {
                "comment_body": "Humans and patience. Mostly I don't have patience for the way we talk about things but the data always proves we do the opposite. \n\nExample: How many extroverts also pretend to care about the climate yet are all too pleased to force as many back into the offices as possible?  Seems they quickly forgot that 2020 was one of the best years in recent history of lower carbon emissions. \n\nAs a species, we say we would do one thing, and yet at the first opportunity we choose the exact opposite. \n\nI hate that about our species. ",
                "comment_url": "/r/CasualConversation/comments/1dquxrt/whats_something_youre_surprisingly_bad_at/latonq5/",
                "comment_id": "latonq5"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dqukrs/older_folks_what_age_would_you_go_back_to_if_you/",
        "thread_title": "Older folks, what age would you go back to if you could?",
        "thread_id": "1dqukrs",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "I'd go back to 9 years old, and advocate for myself when it came to meds. Because adderall had some bad side effects, I've spent 20 years struggling through everything with no support. I think if I'd had meds I would have been able to do a lot more and actually get my life together sooner.\n\nIt also instilled in me the idea that \"medication doesn't work on me, I'm untreatable and just like this\" which I've very slowly been able to erode a way.",
                "comment_url": "/r/CasualConversation/comments/1dqukrs/older_folks_what_age_would_you_go_back_to_if_you/lar5368/",
                "comment_id": "lar5368"
            },
            {
                "comment_body": "I would say 25 or so. Tons of energy, and a body that doesn’t require maintenance to work right for a couple of more years. Grown up, independent and just lacking in and hungry for life experience.\n\nI’m 40 something now and find that I get annoyed that I now get tired from doing a full day (8h) of anything, even if I enjoy the activity. I could just keep going before, I think? But I enjoy my life as is, I’m happy how things have turned out! I would not want to trow it away for another go at it.",
                "comment_url": "/r/CasualConversation/comments/1dqukrs/older_folks_what_age_would_you_go_back_to_if_you/laqsh5z/",
                "comment_id": "laqsh5z"
            },
            {
                "comment_body": "Im 27, and despite my life was blunted by depression for its most part, I woundt go back.The wounds, the mistakes, I appriciate them, those make me though in a sense. Also, what I lost I lost, Im better than ever I believe with friends that I make even in bad times :) I leave it as it is and let life do with me whathever it wants.   \nBut yeah, I agree, time goes fast and faster",
                "comment_url": "/r/CasualConversation/comments/1dqukrs/older_folks_what_age_would_you_go_back_to_if_you/larjk7q/",
                "comment_id": "larjk7q"
            },
            {
                "comment_body": "Back to 8ish years old. My sister would have been 4. To be back little with my family again when my sister was old enough for us to really play together in the yard. I’d love to see my parents young again. Especially my dad.\n\nI wouldn’t want to stay there long though. I like my age. I have a beautiful son and pets that are my babies too.  Definitely not my 20s or 30s. They were good but I don’t want to be 20 or 30 or even a teenager again lol",
                "comment_url": "/r/CasualConversation/comments/1dqukrs/older_folks_what_age_would_you_go_back_to_if_you/larvzu5/",
                "comment_id": "larvzu5"
            },
            {
                "comment_body": "I don’t mind being where I am, but if I could reset with my current wisdom, I would rewind to my mid-20s and take a bunch more risks. I did well but with hindsight know that I could have built a company or two and made a lot more money, earlier, and also lived in more places and had more experiences. The good part about financial risks in your 20s is you have the chance to try again if needed.",
                "comment_url": "/r/CasualConversation/comments/1dqukrs/older_folks_what_age_would_you_go_back_to_if_you/lasfw5t/",
                "comment_id": "lasfw5t"
            },
            {
                "comment_body": "12 to 15. \n\nSomething about those coming of age years where you are in that limbo between innocence and maturity that is absolutely magical. There are a lot of \"first time\" feelings and they are highly potent.  You can feel euphoria from being infatuated with someone. Someone can smile at you or say hi to you and it can feel like your heart will jump out of your chest.  You can play sports for hours and eat junk with little repercussions.",
                "comment_url": "/r/CasualConversation/comments/1dqukrs/older_folks_what_age_would_you_go_back_to_if_you/latcd4y/",
                "comment_id": "latcd4y"
            },
            {
                "comment_body": "I miss being 24, all the partying, the lack of responsibilities, the great job I had back then (great experience next to no pay) but honestly, as others have eluded to here, I really like my mid 30's(and a bit) I did loads of self work through the pandemic lockdowns, got out of a bad relationship, and really am enjoying the age that I'm at. Yeah, going out all night dancing and drinking was great but I love what I have now",
                "comment_url": "/r/CasualConversation/comments/1dqukrs/older_folks_what_age_would_you_go_back_to_if_you/latsd2o/",
                "comment_id": "latsd2o"
            },
            {
                "comment_body": "I tried thinking, but realised that I really love where I am now - 39. Well, if I must really choose, then it’d be back to when I was 17. To remind myself to live those years with colours, than just grey for 18 years. But then, if I lived differently, I wouldn’t know if life would have been what it is now.. the things that make me who i am today. The wisdom gained.. maybe they’d be gone had i gone back in years to relive? So just make the best of your current years! ☺️",
                "comment_url": "/r/CasualConversation/comments/1dqukrs/older_folks_what_age_would_you_go_back_to_if_you/latxf41/",
                "comment_id": "latxf41"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr8orm/where_did_you_get_your_username_from/",
        "thread_title": "Where did you get your username from ",
        "thread_id": "1dr8orm",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "We bought our house from an estate after the previous owner died. She was a very old woman and the back yard was huge (for Los Angeles, where the lots are usually pretty small) but it was full of bamboo. If you've never dealt with wild roaming bamboo, it's like grass with a network of underground roots except the roots were one or two inches thick and too pliable to cut easily. So I spent about 6 hours manually digging up about 10 square feet of bamboo before I gave up, took a break, joined Reddit, and hired someone else with the proper tools to dispose of all of the bamboo.",
                "comment_url": "/r/CasualConversation/comments/1dr8orm/where_did_you_get_your_username_from/latmzya/",
                "comment_id": "latmzya"
            },
            {
                "comment_body": "a competitor for a Chinese noodles restaurant appeared across the street from my family restaurant. this was early 2000s before internet was huge. i knew internet would become big so i created an email address for every single free email service i could think of at the time in a naive attempt to stop them from having it\n\nthey went bust like a year or 2 later. they sucked. although my family restaurant was eventually sold and it is now a delightful Japanese restaurant BUT u can still see the remnants of my family restaurant above the sidewalk cover on a small sign =D",
                "comment_url": "/r/CasualConversation/comments/1dr8orm/where_did_you_get_your_username_from/latpur6/",
                "comment_id": "latpur6"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr9fss/ask_me_a_question_and_ill_answer_it/",
        "thread_title": "Ask me a question, and I’ll answer it.",
        "thread_id": "1dr9fss",
        "is_nsfw": false,
        "comments": []
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr9efd/regardless_of_your_personal_routine_what_truly/",
        "thread_title": "Regardless of your personal routine, what truly marks the beginning of the day—from midnight to sunlight?",
        "thread_id": "1dr9efd",
        "is_nsfw": false,
        "comments": []
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr5rr9/girl_from_my_class_ive_never_talked_to_wished_me/",
        "thread_title": "Girl from my class I've never talked to wished me happy birthday",
        "thread_id": "1dr5rr9",
        "is_nsfw": false,
        "comments": []
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr7niw/anyone_else_here_feel_really_uncritical_of_movies/",
        "thread_title": "Anyone else here feel really uncritical of movies, TV shows, etc.?",
        "thread_id": "1dr7niw",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "I unironically enjoy Little Nicky, Happy Gilmore, and Billy Madison. Some of that stuff is just hilarious. Do I realize what's wrong with those movies from a modern standpoint? Also yeah.\n\nEdit to add - While I understand the criticisms against The Big Bang Theory, I also enjoyed that show, too. The show was made under an older recipe for TV sitcoms anyhow, and I'm part of the population that show regularly ragged on. I'll still laugh.",
                "comment_url": "/r/CasualConversation/comments/1dr7niw/anyone_else_here_feel_really_uncritical_of_movies/lataqx4/",
                "comment_id": "lataqx4"
            },
            {
                "comment_body": "I studied media studies and we had to write film analysis essays every semester. Some movies are better than others for such an analysis. The artsy Cannes Festival type of movie is ideal. But I also looooove so called \"bad movies\". But also I knew a girl in uni who wrote her dissertation on Star Wars movies (the first and second trilogy) and lore. She was going to dedicate an entire chapter on Jar Jar Binx. Hilarious!",
                "comment_url": "/r/CasualConversation/comments/1dr7niw/anyone_else_here_feel_really_uncritical_of_movies/latb3dr/",
                "comment_id": "latb3dr"
            },
            {
                "comment_body": "I hear ya bro, I watch movies or shows to relax .\n\nIf i am not too engaged , I just stop and its just gone from my mind.\n\nA show/movie I feel engaged with, damn bro, gimme them 9 seasons 24 episodes a season lol\n\nIs there plot holes, continuity errors, has the same actor turned up as a different character in 3 episodes, brilliant , \n\nI love it haha :) \n\nIt doesn't have to be that deep",
                "comment_url": "/r/CasualConversation/comments/1dr7niw/anyone_else_here_feel_really_uncritical_of_movies/latggpd/",
                "comment_id": "latggpd"
            },
            {
                "comment_body": "If I don't like it - I avoid it.\n\nI can't really sit there with a straight face all of the time and just accept what's in front of me, good or bad.\n\nI have my own personal tastes to uphold and they're my own tastes. Whether someone is into it or not does not necessarily reflect or influence my tastes. The most anyone would get is just a simple \"yeah I guess it wasn't good\" or \"yeah I guess it wasn't that bad\".\n\nSome people out there are unhealthily defensive or critical of anything anymore.\n\nPeople are allowed to simply not like something or like something. If their answer is either \"I just like it\" or \"I just don't like it\" then deal with it, that's their perspective.",
                "comment_url": "/r/CasualConversation/comments/1dr7niw/anyone_else_here_feel_really_uncritical_of_movies/latrf21/",
                "comment_id": "latrf21"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr9j5s/lets_chat_about_your_first_jobs_and_where_you_are/",
        "thread_title": "Lets chat about your first job(s) and where you are now!",
        "thread_id": "1dr9j5s",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "First job I suppose was babysitting at 12yo.  First actual job was working at Dairy Queen at 16.\n\nI dabbled in college, worked various food service and grocery store jobs, and was a stay at home mom for 9 years.\n\nNow, I work in healthcare administration/financial services for a large healthcare system. My current position is work from home, which really makes my kids happy. They were so used to me being home, they were not fans of the years I was working in office. My plan is to stick with the organization I'm with. I like my job. Plus my employer offers tuition assistance that my kids hope to take advantage of.",
                "comment_url": "/r/CasualConversation/comments/1dr9j5s/lets_chat_about_your_first_jobs_and_where_you_are/latmft2/",
                "comment_id": "latmft2"
            },
            {
                "comment_body": "my first job was actually working at a local ice cream shop when i was 15! i scooped cones and served customers with a big smile 😄 then, in high school, i worked at a coffee shop where i learned to make all sorts of fancy drinks. at 18, i started as a server at a fancy restaurant...xciting and challenging! now, i'm rocking it as a social media manager for a small startup, and i absolutely love it! getting to be creative and help the company grow is the best. still figuring out life, but enjoying the journey!",
                "comment_url": "/r/CasualConversation/comments/1dr9j5s/lets_chat_about_your_first_jobs_and_where_you_are/latuewj/",
                "comment_id": "latuewj"
            },
            {
                "comment_body": "At 16 I got my first job at a mall in Buffalo, NY working at Journeys (the shoe store) and it was like — a “cool” job lol. I’m actually still close friends with my manager from that job and can’t wait to go to her wedding in October! \n\nFast forward…I’m now 36 and live outside of Philadelphia, PA. I work for a county health department in the communicable disease division specializing in HIV prevention.",
                "comment_url": "/r/CasualConversation/comments/1dr9j5s/lets_chat_about_your_first_jobs_and_where_you_are/latuh8i/",
                "comment_id": "latuh8i"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr9au9/new_to_working_environment/",
        "thread_title": "New to working environment ",
        "thread_id": "1dr9au9",
        "is_nsfw": false,
        "comments": []
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dratz1/whats_the_last_dream_you_remember_having/",
        "thread_title": "What's the last dream you remember having?",
        "thread_id": "1dratz1",
        "is_nsfw": false,
        "comments": []
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dqzs80/what_do_you_think_your_best_quality_is/",
        "thread_title": "What do you think your best quality is?",
        "thread_id": "1dqzs80",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "Knowing when I’ve done wrong and wanting to make things right. I get a lot of shit for this by my friends because they sometimes enable my bad behaviour or undermine it at the very least (which I get, because you don’t want your pal to feel crappy). What I mean by that is, I might get into an argument with someone and then we hurl words at each other. Either immediately or after a few days/weeks, I’ll feel pretty bad about it and want to apologise but my friends will say that it was an eye for an eye or that what I did wasn’t too bad. But I’d still want to apologise either way.",
                "comment_url": "/r/CasualConversation/comments/1dqzs80/what_do_you_think_your_best_quality_is/larr1jt/",
                "comment_id": "larr1jt"
            },
            {
                "comment_body": "I’m really good at reading people and responding to their needs (empathy?). If I can sense someone is uncomfortable I adjust, I can tell if someone needs someone to talk to or a hug or to be left alone. I’m also really good with children. I also like to think I’m a pretty humble person! I’ll sit and have the time of my life with someone whose mattress is on the floor the same way I would someone in a 5br house. I feel like my low income upbringing helped build a lot of good character traits.",
                "comment_url": "/r/CasualConversation/comments/1dqzs80/what_do_you_think_your_best_quality_is/lash0fl/",
                "comment_id": "lash0fl"
            },
            {
                "comment_body": "My self confidence and lack of anxiety. It means I rarely get stressed over things that would stress out most people. I'm generally not super concerned about what other people think of me. it doesn't mean I'm not aware certain things may have people judge me negatively and if it's important that they don't I can adapt. But if it's not important I dont let it bother me. \n\nI'm also a pretty honest person. I used to be brutally honest but have since gotten better with my social skills and don't go in with the sledgehammer approach anymore. But generally, my friends and family know that I say what I mean. It makes things much less complicated in my opinion.",
                "comment_url": "/r/CasualConversation/comments/1dqzs80/what_do_you_think_your_best_quality_is/lat51np/",
                "comment_id": "lat51np"
            },
            {
                "comment_body": "Picking things apart. Tends to upset people but I can debate for either side of an argument most times no matter how immoral one side is. I'm more limited by how crazy a person is, like if they are just straight up denying reality without a spiritual angle. \n\nI like this part of myself because I believe it helps me understand the world better and helps protect me from falling into traps where I believe things just because everyone else believes things. It also means I find it pretty easy to admit when I'm wrong because I am used to finding new perspectives that change my world view. It also keeps me honest about why I draw my lines where they are. Sometimes it's just because I don't care, and it's nice not having to justify things there's no justification for.",
                "comment_url": "/r/CasualConversation/comments/1dqzs80/what_do_you_think_your_best_quality_is/lat95b3/",
                "comment_id": "lat95b3"
            },
            {
                "comment_body": "I literally can’t think of one. I guess, once I spent an embarrassing buttload of money  to get a stray cat off the streets in winter, got him vaccinated, and put him in a shelter where they’re prepping him for adoption. I couldn’t keep him because he didn’t get along with my cat at all, but I didn’t want to abandon him out in the shit weather like everyone else told me to do. I made sure he got taken in by a caring shelter. I saw that as a personal failure though as I couldn’t handle making two cats get along despite the effort I put in. \n\nI guess I also tend to feel more remorse and guilt than the average person when I fuck up, which is often. I’m willing to repent. Things people would brush off the next day, it haunts me forever.",
                "comment_url": "/r/CasualConversation/comments/1dqzs80/what_do_you_think_your_best_quality_is/latwodt/",
                "comment_id": "latwodt"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr6wa7/ever_had_that_moment_when_you_put_two_socks_in/",
        "thread_title": "Ever had that moment when you put two socks in the laundry but only one comes out?",
        "thread_id": "1dr6wa7",
        "is_nsfw": false,
        "comments": []
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr2s60/is_it_possible_to_make_friends_in_12th_grade/",
        "thread_title": "Is it possible to make friends in 12th grade after isolating myself all junior year?",
        "thread_id": "1dr2s60",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "I'm sorry to hear that man! It's absolutely possible to make more friends, though. One of the best ways to make friends in high school imo is to join clubs/activities. Pick some that sound interesting and try them out, and you can meet a lot of people with common interests. Things like a sports team or theatre cast have an inherent camaraderie that makes it hard not to be friends. Tbh a lot of the best memories from my senior year were through those kinds of things, too. If you can convince one of the people you already talk to consistently to join something with you, even better! Sometimes joining new things is scary on your own.\n\nAs a side note, there's also nothing wrong with having a small circle of friends <3",
                "comment_url": "/r/CasualConversation/comments/1dr2s60/is_it_possible_to_make_friends_in_12th_grade/lasdi5g/",
                "comment_id": "lasdi5g"
            },
            {
                "comment_body": "Yeah! It may seem impossible but there will always be that small set of people you'll have the same interests with. I'm sure people who knew you are curious about you and would want to get to know you more. Try to let them in when they approach you. But if you think no one will, try to put yourself out there! It takes a little courage (big for someone who's anxious like me) but try to make the most out of your last year. Make memories and do whatever. No one cares! Just have fun",
                "comment_url": "/r/CasualConversation/comments/1dr2s60/is_it_possible_to_make_friends_in_12th_grade/lasm8h4/",
                "comment_id": "lasm8h4"
            },
            {
                "comment_body": "I mean, assuming you’re going to college, you have the chance to totally reset your friend group and become a social butterfly if you really want to.\n\nAs for this year, focus on finding a couple people you like and just trying to keep things going, even if its draining or challenging.\n\nAlso remember reddit is also a great resource for making friends. For example you could DM me, I’m starting college next year so Im definitely on the search for new friends lol.",
                "comment_url": "/r/CasualConversation/comments/1dr2s60/is_it_possible_to_make_friends_in_12th_grade/latfjkb/",
                "comment_id": "latfjkb"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dqs4f8/i_just_had_some_soup/",
        "thread_title": "I just had some soup",
        "thread_id": "1dqs4f8",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "Soup is THE BEST.\n\nI love me some soup.  I make an excellent clam chowder.  Love it.  And I recently figured out how to make tomato soup.  GREAT with a grilled cheese.  I have a beef/cabbage deal I like to do sometimes too.\n\nSoups I can't make?  Love Tom Yum.  Or Pho!\n\nPho is my death-row-last-meal-on-Earth meal.  It's my favorite thing.  Pho, cilantro, onion, noodles, meatballs, sriracha, chili oil, lime - ALL OF IT.  I love PHO.",
                "comment_url": "/r/CasualConversation/comments/1dqs4f8/i_just_had_some_soup/lasq72u/",
                "comment_id": "lasq72u"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1drbibj/i_screwed_up_so_badly/",
        "thread_title": "I screwed up so badly",
        "thread_id": "1drbibj",
        "is_nsfw": false,
        "comments": []
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dralms/a_nonnative_english_speaker_trying_to_learn/",
        "thread_title": "A non-native English speaker trying to learn English",
        "thread_id": "1dralms",
        "is_nsfw": false,
        "comments": []
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr8e60/if_you_could_instantly_become_an_expert_in_one/",
        "thread_title": "If you could instantly become an expert in one skill, what would it be?",
        "thread_id": "1dr8e60",
        "is_nsfw": false,
        "comments": []
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr4rqc/thinking_about_collecting_glass_soda_bottles/",
        "thread_title": "Thinking about collecting glass soda bottles",
        "thread_id": "1dr4rqc",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "Just about any old green glass bottles are especially valuable collectors items from what I understand. If that interests you. They're just so much more rare to find. I believe they're more expensive to make.\n\n\nJuaritos has a 12 flavor 12 pack. I picked one up at Walmart about a month ago. That can kick start your collection with a lot of unique flavors. As far as favorites fo I'm a huge fan of the local brands Ale 8-one and Cheerwine.\n\n\nIf you're interested in cans my uncle from upstate New York loved when we sent him cases of Bubba Cola from Save a Lot down south. There's all kinds of silly southern brands like Mountain Holler.",
                "comment_url": "/r/CasualConversation/comments/1dr4rqc/thinking_about_collecting_glass_soda_bottles/laspnxm/",
                "comment_id": "laspnxm"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dqsnce/do_you_ever_think_about_what_happens_after_we_die/",
        "thread_title": "do you ever think about what happens after we die at least once a day?",
        "thread_id": "1dqsnce",
        "is_nsfw": false,
        "comments": [
            {
                "comment_body": "It's not something I'll ever know about. Human brains are about 80ms behind reality, so when I die I won't even be aware of it happening. After I'm dead I won't have the ability to form memories, gather data or process anything, so I won't know that I'm dead. One moment I'll be alive, the next moment is nothing, and not even the awareness that there is nothing. No darkness, no emptiness. I won't be there. Or anywhere. Hard to be worry about something I'll never know anything about.",
                "comment_url": "/r/CasualConversation/comments/1dqsnce/do_you_ever_think_about_what_happens_after_we_die/larczzt/",
                "comment_id": "larczzt"
            },
            {
                "comment_body": "Yeah, I think about it often and deeply. Not sure if once a day. But I do think deeply about it, like are we just meat robots? Or is there some spiritual aspect to reality? I think from different perspectives with this, to try to find out which is true.\n\nLike, I think about how we can talk, and that makes me give credence to there being a spiritual reality, cause it seems so magical when I think about it, the fact that we can talk, how would that even originate? Then I think about something else that gives credence to there being an atheistic reality. I can't make my mind up.",
                "comment_url": "/r/CasualConversation/comments/1dqsnce/do_you_ever_think_about_what_happens_after_we_die/laqjqnx/",
                "comment_id": "laqjqnx"
            },
            {
                "comment_body": "I only ever think about death when I'm consuming media.. like shows or movie, but usually only when it makes me think about it via having a new or interesting concept/idea lol.\n\nAs you get older you see a lot more death of friends and family, never really made me think about it more I just know it's inevitably coming for everyone. So I'd rather invest my time thinking about other things like fictitious scenarios constantly.",
                "comment_url": "/r/CasualConversation/comments/1dqsnce/do_you_ever_think_about_what_happens_after_we_die/las9pac/",
                "comment_id": "las9pac"
            },
            {
                "comment_body": "If there is something after death, then I don’t think I’d experience it. Like, if there’s a soul, that soul isn’t “me”. There won’t be a continued sense of self. I don’t find the thought scary. Our energy returns to the cosmos to be recycled into something else. We’re all part of our universe, and it’ll go on for what might as well be forever. We won’t experience it all, but who would want to?",
                "comment_url": "/r/CasualConversation/comments/1dqsnce/do_you_ever_think_about_what_happens_after_we_die/lar9wg2/",
                "comment_id": "lar9wg2"
            },
            {
                "comment_body": "Nope. I keep myself too busy to have time to think about it. Even if I do think about it, I just tell myself: \"Time to be extra grateful about what I have.\" For me that means kissing my girlfriend, calling my parents and telling them I love them and playing with my cats.\n\nAs for your predicament, sending you a big hug. Once we die, if we truly are nothing, then we won't feel or remember anything so it's all good 😊👍🏻",
                "comment_url": "/r/CasualConversation/comments/1dqsnce/do_you_ever_think_about_what_happens_after_we_die/las5lxa/",
                "comment_id": "las5lxa"
            },
            {
                "comment_body": "I think (hopefully without sounding kooky) that there’s more to existence than humans have scientifically unpicked yet. Like, we’re not able to routinely put life back into a body once it’s left, or even regrow arms or legs or teeth. So we certainly have a way to go to understand mortality.\n\nTherefore it mostly comes down to beliefs and comprehension of the vastness of the possibilities.\n\nPersonally I believe our life force holds together for a while (different for everyone) and then when ready it dissipates into the primordial energy soup to go around again. \n\nI do think a little something gets left behind with our body, but it’s a link with this life that the energy can revisit, like a connection with our loved ones that hangs around",
                "comment_url": "/r/CasualConversation/comments/1dqsnce/do_you_ever_think_about_what_happens_after_we_die/lasqyib/",
                "comment_id": "lasqyib"
            },
            {
                "comment_body": "I was three years old the first time I asked my dad if I would remember going to the amusement park if I died and reincarnated in someone else, he said no, we don't know if we reincarnate and possibly I won't remember being at the amusement park. \n\nThat thought ruined my mood for the span of time a three year old can pay attention to something. So now I made peace with, maybe by the time death is near I will not care. If I am a ghost I will do something funny but if I just become nothing I will not care then. Just eternal sleep.",
                "comment_url": "/r/CasualConversation/comments/1dqsnce/do_you_ever_think_about_what_happens_after_we_die/lasrksk/",
                "comment_id": "lasrksk"
            },
            {
                "comment_body": "I personally can't wait since it sounds peaceful. The way I figure it, it'd be like how I was before I was born. Don't get me wrong, I'm happy in life generally. But I don't want to live to an age where I'm nursing home eligible. \n\nFor me at least, death seems like this. Imagine it's in the middle of winter. It's snowy and very cold out. It's cold in the house too, of course. Then you lay down in your bed and pull a very comfortable thick comforter on you (imagine the most comfortable fabric you can think of) and it's fresh out of the dryer. You relax on your slowly warming pillow and get nustled in the perfect spot and then fall asleep. \n\nTo me, that's a magical moment when it happens. That's kind of what I equate death to.",
                "comment_url": "/r/CasualConversation/comments/1dqsnce/do_you_ever_think_about_what_happens_after_we_die/lat43s3/",
                "comment_id": "lat43s3"
            },
            {
                "comment_body": "Every day off my life. I look forward to dying. I'm in need of 3 major surgeries, and I can't afford any of them. I work ao don't qualify for state disability or insurance,  I can't even afford the medication I need,  pain killers ,anti-inflammatory shots and so on, the pain is unreal,  I don't wish this upon anyone but even my worst enemy, and at won't point i tried to run that bish over.. but this pain don't wish it onto anyone.. when I pass , at least I know the pain will end. And if I'm lucky , I get to haunt some people 🙃",
                "comment_url": "/r/CasualConversation/comments/1dqsnce/do_you_ever_think_about_what_happens_after_we_die/latjbwk/",
                "comment_id": "latjbwk"
            }
        ]
    },
    {
        "thread_url": "https://new.reddit.com//r/CasualConversation/comments/1dr4on7/at_what_age_did_you_move_out_from_home_and_why/",
        "thread_title": "At what age did you move out from home and why?",
        "thread_id": "1dr4on7",
        "is_nsfw": false,
        "comments": []
    }
]